** org2blog
   :PROPERTIES:
   :POST_DATE: [2013-12-26 木 22:33]
   :ID:       ad095d7e-5d6b-4db8-9fcf-d15e577dd737
   :POSTID:   13
   :BLOG:     cocreative
   :END:

   使い方は [[https://github.com/punchagan/org2blog][punchagan/org2blog]] を参照．
   
#+begin_src emacs-lisp
(dolist (package '(org2blog xml-rpc metaweblog))
  (when (not (package-installed-p package))
    (package-install package)))

(require 'xml-rpc)
(require 'metaweblog)
(require 'org2blog-autoloads)

(setq org2blog/wp-blog-alist
      '(("co-creative.biz"
         :url "http://www.co-creative.biz/xmlrpc.php"
         :username "yc"
         :default-title "Hello World"
         :default-categories ("org2blog" "emacs")
         :tags-as-categories nil)
	))
#+end_src

#+RESULTS:
| cocreative | :url | http://www.co-creative.biz/xmlrpc.php | :username | yc | :default-title | Hello World | :default-categories | (org2blog emacs) | :tags-as-categories | nil |

